<?php

use App\Logging\DatabaseLogProcessingHandler;

return [

    /*
    |--------------------------------------------------------------------------
    | Default Log Channel
    |--------------------------------------------------------------------------
    */

    'default' => 'db',

    /*
    |--------------------------------------------------------------------------
    | Deprecations Log Channel
    |--------------------------------------------------------------------------
    |
    | Депрекейшены тоже пишем в БД (по желанию)
    |
    */

    'deprecations' => [
        'channel' => 'db',
        'trace' => false,
    ],

    /*
    |--------------------------------------------------------------------------
    | Log Channels
    |--------------------------------------------------------------------------
    */

    'channels' => [
        'db' => [
            'driver' => 'monolog',
            'handler' => DatabaseLogProcessingHandler::class,
            'level' => 'info',
        ],
    ],

];
